In [56]:
import pandas as pd
data = pd.read_csv('students.csv')
df = pd.DataFrame(data)

In [57]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
4      Eve   25       New York
5    Frank   28         Boston
6    Grace   22  San Francisco
7    Helen   32    Los Angeles
8      Ivy   29        Chicago
9     Jack   26       New York

In [100]:
def filter_dataframe(df, col, filter_):
    return df[df[col] == filter_]

In [103]:
d = filter_dataframe(df, 'City', 'Chicago')
d['Age'].mean()

np.float64(34.5)

In [102]:
df[df['Age'] >= 30]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
7    Helen   32    Los Angeles